recipe_app_api/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "author", "img", "description", "prep_time", "serving_size", "calories_count", "star_rating", "created_at", "updated_at", "directions", "ingredients") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save

UPDATE "recipes" SET "img" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["img", "https://therecipecritic.com/wp-content/uploads/2019/07/easy_fried_rice-1-500x500.jpg"], ["updated_at", "2020-01-14 19:11:57.541365"], ["id", 1]]
---
  def update
    if @recipe.update(recipe_params)